In [ ]:
import pandas as pd
import numpy as np

In [ ]:
ser = pd.Series([0, 1, 2, 3], index=['a','b','c','d'])
type(ser)

In [ ]:
ser['b':'d']

In [ ]:
ser % 2 != 0

In [ ]:
ser[ser % 2 != 0]

In [ ]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                  index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                  columns=['one', 'two', 'three', 'four'])

In [15]:
df.loc[['Ohio', 'Colorado'], ['one', 'three']]

          one  three
Ohio        0      2
Colorado    4      6

In [17]:
df.iloc[[0, 1], [2, 3]]

          three  four
Ohio          2     3
Colorado      6     7

In [18]:
df.iloc[[0]]

      one  two  three  four
Ohio    0    1      2     3

In [21]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df = pd.DataFrame(mydict)
df.iloc[[True, False, True]]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [22]:
df.iloc[lambda x: x.index % 2 == 0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [24]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [25]:
df.iloc[0, 1]

2

In [28]:
df.iloc[[0, 2], [1]]

      b
0     2
2  2000

In [29]:
df.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

In [30]:
df.iloc[[True, False, True], [True, False, True, True]]

      a     c     d
0     1     3     4
2  1000  3000  4000